HELP_MESSAGE = '''
Доступные аргументы:
help - вывод справки
show - добавление кнопок /show и /show 1
show_shifted - пролистывание расписания
delete - удаление кнопок
'''

SHOW_MESSAGE = '''
Добавлены кнопки:
/show - выводит расписание на текущую неделю
/show 1 - выводит расписание на следующую неделю
'''

SHOW_SHIFTED_MESSAGE = '''
Добавлены кнопки:
Текущая неделя - выводит расписание на текущую неделю
Предыдущая - выводит расписание на предыдущую неделю
Следующая - выводит расписание на следующую неделю
'''

DELETE_MESSAGE = '''Кнопки удалены.'''
